tutorials/FF/dambreak/interFoam-interFoam_bidirectional/Fluid1/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid1;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Mesh;
    patches           (rightWall_outlet);

    readData
    (
    Prgh
    );

    writeData
    (
      Velocity
      Alpha
      PrghGradient
    );
  };
};
